Repository: KurzGedanke/t3ext-image_autoresize
Catalog: Resources/Private/Language/*.locallang_mod.xlf
Languages: da, fr

# title
source: Image Auto-Resize Configuration
da: Image Auto-Resize konfiguration
fr: Configuration de l'auto-redimensionnement des images

# storage.claimed
source: Total storage claimed: %s (with %s images)
da: Totale lager sparet: %s (ved %s billeder)
fr: Espace de stockage total récupéré : %s (avec %s images)

# social.share
source: Share result!
da: Del resultat!
fr: Partagez le résultat !

# social.twitter
source: #image_autoresize already saved %s of free space on my #TYPO3 website
da: #image_autoresize har allerede sparet %s af fri diskplads på mit #TYPO3 website
fr: #image_autoresize a déjà fait gagner %s d'espace disque pour mon site #TYPO3

# batchResizeTask.name
source: Batch resize images
da: Batch ændring af størrelse på billeder
fr: Redimensionnement d'images par lot

# batchResizeTask.description
source: This task crawls directories, searches for files that were not resized automatically during upload (e.g., because they were uploaded through a direct mechanism such as FTP) and resizes them according to your rules. Please note that rules based on user groups will match but then skipped as in the context of the schedular task, groups do not exist.
da: Denne opgave løber gennem mapper og leder efter filer, der ikke automatisk fik ændret størrelse under upload (f. eks fordi de blev uploadet via en direkte forbindelse (FTP, ol)) og ændrer størrelse på dem efter regler angivet i konfigurationen. Vær opmærksom på at regler baseret på brugergrupper vil blive sammenlignet, men herefter droppet, fordi kontekst i Scheduler opgaven ikke inkluderer brugergrupper.
fr: Cette tâche parcourt les répertoires, recherche des fichiers qui n'ont pas été redimensionnés automatiquement lors du chargement (p. ex. parce qu'ils ont été chargés par un mécanisme direct comme FTP) et les redimensionne selon vos règles. Veuillez noter que les règles basées sur des groupes d'utilisateurs vont être détectées mais auront pour effet de suspendre le traitement puisque dans le contexte d'une tâche planifiée, les groupes n'existent pas.

# label.batchResize.directories
source: Directories to process (one by line, overrides watched directories):
da: Mapper der skal gennemløbes (en pr. linje, tilsidesætter overvågende mapper):
fr: Répertoires à traiter (un par ligne, surcharge les répertoires surveillés) :

# label.batchResize.excludeDirectories
source: Exclude directories (one by line):
da: Udeluk mapper (én pr. linje):
fr: Exclure les répertoires (un par ligne) :

# msg.invalidDirectories
source: Cannot process non-existing directory: %s
da: Kan ikke løbe gennem mapper der ikke eksisterer: %s
fr: Impossible de traiter un répertoire qui n'existe pas : %s

# msg.invalidExcludeDirectories
source: Cannot exclude non-existing directory: %s
da: Kan ikke udelukke mapper der ikke eksisterer: %s
fr: Impossible d'exclure un répertoire qui n'existe pas : %s
